Revit 2027 API
ZoneEquipmentData.HeatingCoilType Property
 The type of heating coil. Note this property change would reset the hot water loop.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AirHeatingCoilType HeatingCoilType { get; set; }
Public Property HeatingCoilType As AirHeatingCoilType
	Get
	Set
public:
property AirHeatingCoilType HeatingCoilType {
	AirHeatingCoilType get ();
	void set (AirHeatingCoilType value);
}
member HeatingCoilType : AirHeatingCoilType with get, set
Property Value
AirHeatingCoilType
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ZoneEquipmentData Class
Autodesk.Revit.DB.Mechanical Namespace